#+NAME: Sharing.io production cluster

** Initialize the packet plugin for Cluster-API

#+begin_src tmate :window cluster-api-apply :session packet-cluster-api :noweb yes
export PACKET_PROJECT_ID=<<get-packet-project-id()>>
    export PACKET_API_KEY=<<get-packet-auth-token()>>
clusterctl init --infrastructure=packet
#+end_src

   #+RESULTS:
   #+begin_example
   #+end_example

